import { Container } from "@mui/material";

import { useTranslate } from "src/locales";

import CustomBreadcrumbs from "src/components/custom-breadcrumbs";

import PrivacyPolicyContent from "../privacy-policy-content";

export default function PrivacyPolicyView() {

    const { t } = useTranslate();

    return (
        <Container
            maxWidth="lg"
            sx={{
                mt: 5,
                mb: 2,
            }}
        >
            <CustomBreadcrumbs
                links={[
                    { name: t('common.home'), href: '/' },
                    { name: 'Privacy Policy' }
                ]}
                sx={{ mb: 2 }}
            />

            <PrivacyPolicyContent />

            {/* <Box sx={{ flexGrow: 1, textAlign: 'center' }}>
                <Typography
                    variant="h4"
                    sx={{
                        my: { xs: 3, md: 2 },
                    }}
                >
                    นโยบายความเป็นส่วนตัว (Privacy Policy)
                </Typography>
            </Box>
            <Box sx={{ flexGrow: 1, justifyContent: 'center', display: 'flex', mb: 2 }}>
                <Typography sx={{ textIndent: '30px', maxWidth: 1000, width: '100%' }}>
                    บริษัท เรซอัพ เวิร์ค จำกัด (“ผู้ให้บริการ”) ตระหนักและใส่ใจถึงนโยบายความเป็นส่วนตัวของผู้ใช้บริการ (“ผู้ใช้บริการ”) ที่เข้าใช้บริการผ่านช่องทางต่างๆ ของผู้ให้บริการในปัจจุบัน และรวมถึงช่องทางเพิ่มเติมในอนาคต (“บริการ”) ทางผู้ให้บริการ จึงได้กำหนด การเก็บรวบรวม ใช้ และเปิดเผย ข้อมูลส่วนบุคคล โดยผู้ใช้บริการรับทราบและยินยอมในข้อตกลงและข้อกำหนดในการใช้บริการ
                </Typography>
            </Box>

            <Box sx={{ flexGrow: 1, justifyContent: 'center', display: 'flex', flexDirection: 'column', alignItems: 'center', mb: 2 }}>
                <Typography
                    variant="subtitle1"
                    sx={{
                        my: { xs: 3, md: 2 },
                        maxWidth: 1000,
                        width: '100%'
                    }}
                >
                    1.วัตถุประสงค์ในการเก็บรวบรวมข้อมูลส่วนบุคคล
                </Typography>
                <Typography sx={{ textIndent: '30px', maxWidth: 1000, width: '100%' }}>
                    เพื่อให้การบริการเป็นไปอย่างมีประสิทธิภาพ ถูกต้อง รวดเร็ว และตอบโจทย์ความต้องการของผู้ใช้บริการ ผู้ให้บริการจึงมีการเก็บข้อมูลส่วนบุคคลตามที่จำเป็น เพื่อให้สามารถทำตามวัตถุประสงค์ของผู้ใช้บริการ ในการใช้บริการต่างๆ ใช้ในการประมวลผลเพื่อให้ผู้ให้บริการทราบถึงข้อมูลและสถิติต่างๆ ในการใช้บริการ เพื่อให้สามารถนำข้อมูลมาปรับปรุง และพัฒนาช่องทางบริการต่างๆ เพื่อให้ผู้ใช้บริการได้รับประสบการณ์ที่ดีในการใช้งาน สามารถใช้งานได้สะดวกสบาย และเกิดประโยชน์สูงสุด แจ้งข้อมูล ข่าวสาร กิจกรรม ผลิตภัณฑ์ และรายการส่งเสริมการขาย ผ่านช่องทางของผู้ให้บริการ และพันธมิตรที่เกี่ยวข้อง
                </Typography>
            </Box>

            <Box sx={{ flexGrow: 1, justifyContent: 'center', display: 'flex', flexDirection: 'column', alignItems: 'center', mb: 2 }}>
                <Typography
                    variant="subtitle1"
                    sx={{
                        my: { xs: 3, md: 2 },
                        maxWidth: 1000,
                        width: '100%'
                    }}
                >
                    2.การเก็บรวบรวมข้อมูลส่วนบุคคล
                </Typography>
                <Typography sx={{ textIndent: '30px', maxWidth: 1000, width: '100%' }}>
                    ผู้ให้บริการได้รับข้อมูลส่วนบุคคลโดยได้รับผ่านทางการใช้บริการ เมื่อมีความจำเป็นในการดำเนินการตามวัตถุประสงค์ โดยข้อมูลเหล่านั้นรวมถึง
                </Typography>
                <Box sx={{ paddingLeft: 10, maxWidth: 1000, width: '100%' }}>
                    <List sx={{ listStyleType: 'disc' }}>
                        <ListItem sx={{ display: 'list-item', lineHeight: '25px' }}>ชื่อ นามสกุล อายุ วันเดือนปีเกิด เพศ เลขประจำตัวประชาชน / หนังสือเดินทาง</ListItem>
                        <ListItem sx={{ display: 'list-item', lineHeight: '25px' }}>ช่องทางการติดต่อ เช่น อีเมล์ ที่อยู่จัดส่ง ที่อยู่ในการออกใบกำกับภาษี หมายเลขโทรศัพท์</ListItem>
                        <ListItem sx={{ display: 'list-item', lineHeight: '25px' }}>ข้อมูลการสั่งซื้อสินค้า และ/หรือ บริการ</ListItem>
                        <ListItem sx={{ display: 'list-item', lineHeight: '25px' }}>ข้อมูลบัญชีผู้ใช้งาน user name , password, recovery email รูปภาพ</ListItem>
                        <ListItem sx={{ display: 'list-item', lineHeight: '25px' }}>ข้อมูลการทำธุรกรรมและการเงิน รายละเอียดบัตรเครดิต บัญชีธนาคาร ประวัติการสั่งซื้อ</ListItem>
                        <ListItem sx={{ display: 'list-item', lineHeight: '25px' }}>ข้อมูลอื่นๆ ตามที่จำเป็น เช่นข้อมูลการรีวิวสินค้าและบริการ ข้อเสนอแนะ</ListItem>
                        <ListItem sx={{ display: 'list-item', lineHeight: '25px' }}>ข้อมูลโดยใช้ Cookies เพื่อเพิ่มประสบการณ์การใช้งานของผู้ใช้บริการให้มีประสิทธิภาพมากขึ้น</ListItem>
                        <ListItem sx={{ display: 'list-item', lineHeight: '25px' }}>ข้อมูลส่วนบุคคลของผู้ใช้บริการอาจถูกเปิดเผยต่อบุคคลหรือนิติบุคคลที่เกี่ยวข้องเช่น บุคคลและนิติบุคคลที่เกี่ยวข้องกับการให้บริการ และกิจกรรม ตามจำเป็น เช่น ผู้จัดงานวิ่ง ช่างภาพ ประกันอุบัติเหตุ(ในวันแข่งขัน) ผู้ให้บริการจัดส่งและขนส่งสินค้าและผลิตภัณฑ์</ListItem>
                        <ListItem sx={{ display: 'list-item', lineHeight: '25px' }}>ผู้ให้บริการประมวลข้อมูลเพื่อให้ผู้ใช้บริการได้รับข่าวสาร กิจกรรม ผลิตภัณฑ์ การส่งเสริมการขายและการบริการ เพื่อประโยชน์สูงสุดของผู้ใช้บริการ เช่น search engine, social media, E-commerce ต่างๆ</ListItem>
                    </List>
                </Box>
            </Box>

            <Box sx={{ flexGrow: 1, justifyContent: 'center', display: 'flex', flexDirection: 'column', alignItems: 'center', mb: 2 }}>
                <Typography
                    variant="subtitle1"
                    sx={{
                        my: { xs: 3, md: 2 },
                        maxWidth: 1000,
                        width: '100%'
                    }}
                >
                    3.ระยะเวลาในการจัดเก็บข้อมูล
                </Typography>
                <Typography sx={{ textIndent: '30px', maxWidth: 1000, width: '100%' }}>
                    ผู้ให้บริการจะทำการเก็บรักษาข้อมูลที่ได้รับจากผู้ใช้บริการ ด้วยระบบรักษาความปลอดภัยที่ได้มาตรฐาน จนกว่าจะมีการแก้ไข เปลี่ยนแปลง หรือยกเลิกโดยผู้ใช้บริการ และหากบัญชีของผู้ใช้บริการไม่มีการเคลื่อนไหวใดๆๆ ติดต่อกันเป็นระยะเวลา 5 ปี ผู้ให้บริการจะทำการลบข้อมูลส่วนบุคคลออกจากระบบ
                </Typography>
            </Box>

            <Box sx={{ flexGrow: 1, justifyContent: 'center', display: 'flex', flexDirection: 'column', alignItems: 'center', mb: 2 }}>
                <Typography
                    variant="subtitle1"
                    sx={{
                        my: { xs: 3, md: 2 },
                        maxWidth: 1000,
                        width: '100%'
                    }}
                >
                    4. การมีส่วนร่วมของบุคคลภายนอกต่อบริการและลิงก์ภายนอก
                </Typography>
                <Typography sx={{ textIndent: '30px', maxWidth: 1000, width: '100%' }}>
                    4.1 ผู้มีส่วนร่วมในบริการแต่ละคน ในด้านข้อมูล ข้อความ ภาพ เสียง วิดีโอ ซอฟต์แวร์ และเนื้อหาอื่นๆ เป็นผู้รับผิดชอบแต่เพียงผู้เดียวต่อความถูกต้อง ความน่าเชื่อถือ ลักษณะ การปลอดจากสิทธิ์ การตรงตามกฎหมายและข้อจำกัดทางกฎหมาย ที่เกี่ยวข้องกับเนื้อหาที่ส่งเข้ามา ดังนั้น บริษัทฯจะไม่รับผิดชอบต่อ และจะไม่เฝ้าติดตามหรือตรวจสอบอย่างสม่ำเสมอถึงความถูกต้อง ความน่าเชื่อถือ ลักษณะ การปลอดจากสิทธิ์ การตรงตามกฎหมายและข้อจำกัดทางกฎหมาย ที่เกี่ยวข้องกับเนื้อหาที่ส่งเข้ามา ท่านจะไม่กำหนดให้ บริษัทฯต้องรับผิดชอบต่อการดำเนินการหรือไม่ดำเนินการของผู้ใช้ รวมถึงแต่ไม่จำกัดเพียง สิ่งที่โพสต์หรือทำให้ใช้งานได้ผ่านทางบริการ
                </Typography>
                <Typography sx={{ textIndent: '30px', maxWidth: 1000, width: '100%' }}>
                    4.2 นอกจากนี้ บริการอาจมีลิงก์ไปยังผลิตภัณฑ์ เว็บไซต์ บริการและข้อเสนอของบุคคลภายนอก ลิงก์ผลิตภัณฑ์ เว็บไซต์ บริการของบุคคลภายนอกเหล่านี้ไม่ได้เป็นของหรือควบคุมโดย บริษัทฯแต่ดำเนินการโดย และเป็นทรัพย์สินของบุคคลภายนอกที่เกี่ยวข้อง และอาจได้รับการคุ้มครองตามกฎหมายลิขสิทธิ์หรือกฎหมายและสนธิสัญญาว่าด้วยทรัพย์สินทางปัญญาอื่นๆ ที่บังคับใช้ บริษัทฯไม่ได้ตรวจสอบ และไม่รับผิดชอบต่อเนื้อหา ฟังก์ชั่นการทำงาน ความปลอดภัย บริการ นโยบายความเป็นส่วนตัว หรือการปฏิบัติอื่นๆ ของบุคคลภายนอกเหล่านี้ ขอแนะนำให้อ่านข้อกำหนดและนโยบายอื่นๆ ที่เผยแพร่บนเว็บไซต์หรืออื่นๆ โดยบุคคลภายนอกดังกล่าว ในการใช้บริการ ท่านตกลงว่าบริษัทฯจะไม่รับผิดชอบในลักษณะใดก็ตามอันเนื่องมาจากการใช้งานของท่านหรือการไม่สามารถใช้งานเว็บไซต์หรือวิดเจ็ตใดๆ ท่านรับทราบและตกลงต่อไปด้วยว่า บริษัทฯอาจยกเลิกการใช้งานของท่านหรือลบลิงก์ของบุคคลภายนอก หรือแอปพลิเคชั่นบนบริการ ตามขอบเขตที่การใช้งานนั้นละเมิดเงื่อนไขการให้บริการนี้
                </Typography>
            </Box>

            <Box sx={{ flexGrow: 1, justifyContent: 'center', display: 'flex', flexDirection: 'column', alignItems: 'center', mb: 2 }}>
                <Typography
                    variant="subtitle1"
                    sx={{
                        my: { xs: 3, md: 2 },
                        maxWidth: 1000,
                        width: '100%'
                    }}
                >
                    5. กฎหมายที่ใช้บังคับ
                </Typography>
                <Typography sx={{ textIndent: '30px', maxWidth: 1000, width: '100%' }}>
                    เงื่อนไขการให้บริการนี้จะอยู่ภายใต้บังคับและตีความตามกฎหมายของประเทศไทย โดยไม่คำนึงถึงความขัดแย้งกับกฎแห่งกฎหมาย อนุสัญญาสหประชาชาติว่าด้วยสัญญาการจำหน่ายสินค้าระหว่างประเทศและกฎหมายธุรกรรมข้อมูลคอมพิวเตอร์ที่เป็นมาตรฐานเดียวกัน ถึงขอบเขตที่บังคับใช้ได้ ถูกสงวนสิทธิ์ไว้อย่างชัดแจ้ง เว้นแต่กฎหมายที่บังคับใช้จะกำหนดไว้เป็นอย่างอื่น ข้อพิพาท ข้อขัดแย้ง การเรียกร้องสิทธิหรือความแตกต่างทุกประเภทที่อาจจะเกิดขึ้น จากหรือเกี่ยวข้องกับเงื่อนไขการให้บริการนี้ ต่อหรือเกี่ยวข้องกับบริษัทหรือฝ่ายที่ได้รับการชดใช้ภายใต้เงื่อนไขการให้บริการนี้ ให้ส่งเรื่องและยุติในขั้นตอนสุดท้ายโดยอนุญาโตตุลาการประเทศไทยตามกฎการอนุญาโตตุลาการของสถาบันอนุญาโตตุลาการ (“กฎ THAC”) ที่บังคับใช้อยู่ในขณะนี้ ซึ่งถือว่าได้รวมกฎเข้าไว้โดยการอ้างอิงในส่วนนี้ จะมีอนุญาโตตุลาการหนึ่ง 1 ท่านและภาษาในการอนุญาโตตุลาการคือภาษาไทย
                </Typography>
            </Box>

            <Box sx={{ flexGrow: 1, justifyContent: 'center', display: 'flex', flexDirection: 'column', alignItems: 'center', mb: 2 }}>
                <Typography
                    variant="subtitle1"
                    sx={{
                        my: { xs: 3, md: 2 },
                        maxWidth: 1000,
                        width: '100%'
                    }}
                >
                    6. ความจำเป็นเพื่อเข้าทำสัญญาและผลกระทบที่เป็นไปได้จากการไม่ให้ข้อมูลส่วนบุคคล
                </Typography>
                <Typography sx={{ textIndent: '30px', maxWidth: 1000, width: '100%' }}>
                    ในกรณีที่บริษัทมีความจำเป็นต้องเก็บรวบรวมข้อมูลส่วนบุคคลของท่านเพื่อการปฏิบัติตามสัญญา การปฏิบัติหน้าที่ตามกฎหมายหรือเพื่อความจำเป็นในการเข้าทำสัญญา หากท่านปฏิเสธไม่ให้ข้อมูลส่วนบุคคลหรือ คัดค้านการดำเนินการประมวลผลตามวัตถุประสงค์ของกิจกรรม อาจมีผลทำให้บริษัทไม่สามารถดำเนินการหรือให้บริการตามที่ท่านร้องขอได้ทั้งหมดหรือบางส่วน
                </Typography>
            </Box>

            <Box sx={{ flexGrow: 1, justifyContent: 'center', display: 'flex', flexDirection: 'column', alignItems: 'center', mb: 2 }}>
                <Typography
                    variant="subtitle1"
                    sx={{
                        my: { xs: 3, md: 2 },
                        maxWidth: 1000,
                        width: '100%'
                    }}
                >
                    7. ข้อมูลการติดต่อเจ้าหน้าที่คุ้มครองข้อมูลส่วนบุคคลหรือตัวแทน (ถ้ามี)
                </Typography>
                <Typography sx={{ maxWidth: 1000, width: '100%', mb: 1 }}>
                    เจ้าหน้าที่คุ้มครองข้อมูล (DPO)
                </Typography>
                <Typography sx={{ maxWidth: 1000, width: '100%' }}>
                    บริษัท เรซอัพ เวิร์ค จำกัด ที่อยู่เลขที่ 890/212 ชั้นที่ 24 ห้องที่ 212 ถ.พระราม3 แขวงบางโพงพาง เขตยานนาวา กรุงเทพมหานคร 10120 อีเมล info@checkrace.com
                </Typography>
            </Box>

            <Box sx={{ flexGrow: 1, justifyContent: 'center', display: 'flex', flexDirection: 'column', alignItems: 'center', mb: 2 }}>
                <Typography
                    variant="subtitle1"
                    sx={{
                        my: { xs: 3, md: 2 },
                        maxWidth: 1000,
                        width: '100%'
                    }}
                >
                    8. สิทธิของเจ้าของข้อมูลส่วนบุคคลตาม PDPA
                </Typography>
                <Typography sx={{ maxWidth: 1000, width: '100%', mb: 1 }}>
                    เสิทธิของท่าน ท่านมีสิทธิหลายประการเกี่ยวกับ การเก็บรวบรวม ใช้เปิดเผย และ/หรือ โอนข้อมูลส่วนบุคคล ภายใต้บังคับแห่ง บทบัญญัติของกฎหมายว่าด้วยการคุ้มครองข้อมูลส่วนบุคคล
                </Typography>
                <Box sx={{ paddingLeft: 10, maxWidth: 1000, width: '100%' }}>
                    <List sx={{ listStyleType: 'decimal' }}>
                        <ListItem sx={{ display: 'list-item', lineHeight: '25px' }}><b>สิทธิในการเข้าถึง :</b> ท่านมีสิทธิในการขอเข้าถึงและขอรับสำเนาข้อมูลส่วนบุคคล หรือขอให้เปิดเผยถึงการได้มาของข้อมูลส่วนบุคคลที่ตนไม่ได้ให้ความยินยอม (ซึ่งเรามีสิทธิในการเก็บค่าดำเนินการตามความเหมาะสมและเป็นไปตามกฎหมายเพื่อให้คำขอของท่านสมบูรณ์)</ListItem>
                        <ListItem sx={{ display: 'list-item', lineHeight: '25px' }}><b>สิทธิการแก้ไข :</b>  ท่านมีสิทธิขอให้มีการดำเนินการแก้ไขข้อมูลส่วนบุคคลให้ถูกต้อง เป็นปัจจุบัน สมบูรณ์และไม่ก่อให้เกิดความเข้าใจผิด</ListItem>
                        <ListItem sx={{ display: 'list-item', lineHeight: '25px' }}><b>สิทธิในการร้องเรียน :</b>  ท่านมีสิทธิยื่นคำร้องต่อเจ้าหน้าที่ผู้มีอำนาจหากท่านเห็นว่าการเก็บรวบรวม ใช้และ/หรือ เปิดเผยข้อมูลส่วนบุคคลของท่านไม่ชอบด้วยกฎหมาย หรือไม่เป็นไปตามกฎหมายคุ้มครองข้อมูลส่วนบุคคลที่บังคับใช้ อย่างไรก็ตาม เราใคร่ขอให้ท่านโปรดแจ้งให้เราทราบถึงข้อกังวลของท่านเป็นลำดับแรก เพื่อดำเนินการแก้ไขข้อกังวลดังกล่าวก่อนที่ท่านจะติดต่อหน่วยงานที่เกี่ยวข้อง</ListItem>
                        <ListItem sx={{ display: 'list-item', lineHeight: '25px' }}><b>สิทธิในการขอให้ลบข้อมุลส่วนบุคคล :</b>  ท่านมีสิทธิขอให้เราลบหรือทำลาย หรือทำให้ข้อมูลส่วนบุคคลเป็นข้อมูลที่ไม่สามารถระบุตัวบุคคลที่เป็นเจ้าของข้อมูลส่วนบุคคลได้ ในกรณีที่ข้อมูลส่วนบุคคลนั้นหมดความจำเป็นในการเก็บรักษาไว้ตามวัตถุประสงค์ที่ระบุไว้ในนโยบายคุ้มครองข้อมูลส่วนบุคคลฉบับนี้ หรือในกรณีที่ไม่มีฐานทางกฎหมายในการดำเนินการเกี่ยวกับข้อมูลนั้นๆ</ListItem>
                        <ListItem sx={{ display: 'list-item', lineHeight: '25px' }}><b>สิทธิในการคัดค้าน :</b>  ท่านมีสิทธิคัดค้านการใช้ข้อมูลส่วนบุคคลของท่านเพื่อการตลาดโดยตรง (รวมถึงการทำโปรไฟล์ที่เกี่ยวข้อง) หรือดำเนินการอื่นๆ ที่ปนะมวลโดยอาศัยฐานประโยชน์ที่ชอบด้วยกฎหมาย</ListItem>
                        <ListItem sx={{ display: 'list-item', lineHeight: '25px' }}><b>สิทธิในการขอให้ส่งสำเนาข้อมูลส่วนบุคคล :</b>  ในบางกรณี ท่านมีสิทธิขอรับสำเนาข้อมูลส่วนบุคคลของท่านในกรณีที่เราได้ทำให้ข้อมูลบุคคลนั้นอยู่ในรูปแบบที่สามารถอ่านหรือใช้งานโดยทั่วไปได้ด้วยเครื่องมือหรืออุปกรณ์ที่ทำงานได้โดยอัตโนมัติ และสามารถใช้หรือเปิดเผยข้อมูลส่วนบุคคลได้ด้วยวิธีการอัตโนมัติ รวมทั้งสิทธิในการขอให้ส่งหรือโอนข้อมูลส่วนบุคคลในรูปแบบดังกล่าวไปยังผู้ควบคุมข้อมูลส่วนบุคคลอื่นเมื่อสามารถทำได้ด้วยวิธีการอัตโนมัติ และสิทธิขอรับข้อมูลส่วนบุคคลที่ส่งหรือโอนไปยังผู้ควบคุมข้อมูลส่วนบุคคลที่ส่งหรือโอนไปยังผู้ควบคุมข้อมูลส่วนบุคคลอื่นโดยตรง เว้นแต่โดยสภาพทางเทคนิคไม่สามารถทำได้</ListItem>
                        <ListItem sx={{ display: 'list-item', lineHeight: '25px' }}><b>สิทธิในการระงับการใช้ข้อมูลส่วนบุคคล :</b>   กรณีอยู่ระหว่างการตรวจสอบเพื่อแก้ไขข้อมูลที่ถูกต้อง หรือหากเป็นข้อมูลส่วนบุคคลที่บริษัทจะต้องลบ หรือทำลายเพราะหมดความจำเป็นแล้ว เจ้าของข้อมูลมีสิทธิในการขอให้บริษัทระงับการใช้ข้อมูลส่วนบุคคลนั้นเป็นการชั่วคราวได้</ListItem>
                        <ListItem sx={{ display: 'list-item', lineHeight: '25px' }}><b>สิทธิในการถอนความยินยอม :</b>   ท่านมีสิทธิถอนความยินยอมเมื่อใดก็ได้ในกรณีที่ท่านได้ให้ความยินยอมในการเก็บรวบรวม ใช้ และ/หรือเปิดเผยข้อมูลส่วนบุคคลของท่าน ทั้งนี้ การถอนความยินยอมจะไม่กระทบต่อความชอบด้วยกฎหมายในการเก็บรวบรวม ใช้ และ/หรือ เปิดเผยข้อมูลส่วนบุคคลและข้อมูลส่วนบุคคลที่ละเอียดอ่อนที่อาศัยความยินยอมของท่านที่เคยให้ไว้ก่อนการเพิกถอนนั้น อย่างไรก็ตาม หากท่านไม่ให้ความยินยอม หรือข้อมูลส่วนบุคคลของท่านแก่เรา หรือได้เพิกถอนความยินยอมของท่านในภายหลัง เราอาจไม่สามารถจัดหาผลิตภัณฑ์หรือให้บริการทั้งหมด หรือบางส่วนให้แก่ท่านได้การขอใช้สิทธิของท่านตามที่กำหนดข้างต้นอาจมีข้อจำกัดสิทธิตามกฎหมาย และในบางกรณีเราสามารถปฏิเสธคำขอของท่านเมื่อมีเหตุผลอันสมควร และเป็นไปโดยชอบด้วยกฎหมาย เช่น เป็นกรณีที่เราต้องปฏิบัติหน้าที่ตามกฎหมายหรือตามคำสั่งศาล หากท่านต้องการใช้สิทธิหรือต้องการคำอธิบายเกี่ยวกับสิทธิต่างๆ ท่านสามารถติดต่อเรา ได้ตามรายละเอียดในหัวข้อ “ติดต่อเรา” ในกรณีที่ท่านประสงค์จะพูดคุยกับเรา ผู้ควบคุมข้อมูลส่วนบุคคลของท่านคือ บริษัท เรซอัพ เวิร์ค จำกัด</ListItem>
                    </List>
                </Box>
            </Box>

            <Box sx={{ flexGrow: 1, justifyContent: 'center', display: 'flex', flexDirection: 'column', alignItems: 'center', mb: 2 }}>
                <Typography
                    variant="subtitle1"
                    sx={{
                        my: { xs: 3, md: 2 },
                        maxWidth: 1000,
                        width: '100%'
                    }}
                >
                    ติดต่อเรา
                </Typography>
                <Typography sx={{ maxWidth: 1000, width: '100%', mb: 1 }}>
                    การติดต่อเกี่ยวกับข้อมูลส่วนบุคคลของผู้ใช้บริการสามารถติดต่อได้ที่ บริษัท เรซอัพ เวิร์ค จำกัด ที่อยู่เลขที่ 890/212 ชั้นที่ 24 ห้องที่ 212 ถ.พระราม3 แขวงบางโพงพาง เขตยานนาวา กรุงเทพมหานคร 10120 หรือทางอีเมล info@raceup.co.th
                </Typography>
            </Box>

            <Box sx={{ flexGrow: 1, textAlign: 'center' }}>
                <Typography
                    variant="h4"
                    sx={{
                        my: { xs: 3, md: 2 },
                    }}
                >
                    ข้อตกลงการใช้บริการ
                </Typography>
            </Box>

            <Box sx={{ flexGrow: 1, justifyContent: 'center', display: 'flex', mb: 2 }}>
                <Typography sx={{ textIndent: '30px', maxWidth: 1000, width: '100%' }}>
                    การเข้าถึงหรือใช้บริการเว็บไซต์หรือแอปพลิเคชันหรือ Checkrace (“เว็บไซต์หรือแอปพลิเคชัน”) ภายใต้การควบคุมดูแลของ บริษัท เรซอัพ เวิร์ค จำกัด หรือ Raceup Work Co.,Ltd. (“บริษัท”) (รวมถึงบริษัทสาขาบริษัทในเครือ กิจการที่บริษัท เป็นหุ้นส่วน บริษัทย่อย ตัวแทน พนักงานเจ้าหน้าที่หรือผู้ที่ได้รับมอบอำนาจ รวมเรียกว่า “บริษัท” “Raceup Work Co.,Ltd.” หรือ “เรา”) หมายถึงท่านยอมรับข้อกำหนดและเงื่อนไขเหล่าที่ปรากฏบนเว็บไซต์หรือแอปพลิเคชันว่ามีผลผูกพันตามกฎหมาย (“เงื่อนไข”) และท่านยังยอมรับนโยบายความเป็นส่วนตัวของเว็บไซต์หรือแอปพลิเคชันและยอมรับที่จะปฏิบัติตามกฎระเบียบอื่นๆ บนเว็บไซต์หรือแอปพลิเคชัน เช่นวิธีการใช้ วิธีปฏิบัติและขั้นตอน หรือเงื่อนไขสำหรับการเข้าถึงหรือการใช้บริการของเว็บไซต์หรือแอปพลิเคชัน
                </Typography>
            </Box>

            <Box sx={{ flexGrow: 1, justifyContent: 'center', display: 'flex', flexDirection: 'column', alignItems: 'center', mb: 2 }}>
                <Typography
                    variant="subtitle1"
                    sx={{
                        my: { xs: 3, md: 2 },
                        maxWidth: 1000,
                        width: '100%'
                    }}
                >
                    1. เงื่อนไขโดยทั่วไป
                </Typography>
                <Typography sx={{ maxWidth: 1000, width: '100%', mb: 1 }}>
                    เมื่อท่านใช้บริการผ่านเว็บไซต์หรือแอปพลิเคชัน หมายถึง ท่านยอมรับข้อตกลงและเงื่อนไขทั้งหมดในการใช้บริการ กรุณาอ่านข้อตกลงและเงื่อนไขอย่างละเอียด การสร้างบัญชีหรือใช้บริการผ่านเว็บไซต์หรือแอปพลิเคชัน ถือว่าท่านได้อ่าน เข้าใจ ยินยอมและตกลงที่จะปฏิบัติตามข้อตกลงและเงื่อนไขบริการ รวมถึงระเบียบและข้อกฎหมายที่เกี่ยวข้อง (รวมเรียกว่า “ข้อตกลง” หรือ “เงื่อนไข”) นอกจากนี้การใช้บริการผ่านเว็บไซต์หรือแอปพลิเคชัน รวมถึงช่องทางอื่นใดที่มีหรือจะมีขึ้นในอนาคตภายใต้ควบคุมหรือดูแลโดยบริษัท (รวมเรียกว่า “บริการ” หรือ “เว็บไซต์หรือแอปพลิเคชัน”) หมายถึงท่านยอมรับเงื่อนไขที่ปรากฏบนเว็บไซต์หรือแอปพลิเคชันว่ามีผลผูกพันตามกฎหมาย และยอมรับนโยบายความเป็นส่วนตัวของบริษัท พร้อมทั้งจะปฏิบัติตามกฎระเบียบอื่นๆ บนเว็บไซต์หรือแอปพลิเคชันเช่น วิธีการใช้ วิธีปฏิบัติ หรือขั้นตอนของการใช้บริการ ทั้งนี้ บริษัท สงวนสิทธิ์โดยไม่ต้องแจ้งให้ท่านทราบล่วงหน้าถึงการเปลี่ยนแปลง แก้ไข ระงับ หรือยกเลิกข้อตกลงหรือเงื่อนไข กฎหมายที่ใช้บังคับ ข้อกำหนดตามกฎระเบียบหรือการรักษาความปลอดภัย การเปลี่ยนแปลงทางเทคนิคในบริการของบริษัท
                </Typography>
            </Box>

            <Box sx={{ flexGrow: 1, justifyContent: 'center', display: 'flex', flexDirection: 'column', alignItems: 'center', mb: 2 }}>
                <Typography
                    variant="subtitle1"
                    sx={{
                        my: { xs: 3, md: 2 },
                        maxWidth: 1000,
                        width: '100%'
                    }}
                >
                    2. การสร้างบัญชีของท่าน
                </Typography>
                <Typography sx={{ maxWidth: 1000, width: '100%', mb: 1 }}>
                    การใช้บริการท่านจะต้องลงทะเบียนชื่อบัญชีและตั้งรหัสผ่าน ให้รายละเอียดต่างๆ ที่เกี่ยวข้องกับตนเองที่ถูกต้อง สมบูรณ์ และตรงต่อความเป็นจริงผ่านการลงทะเบียนบนเว็บไซต์หรือแอปพลิเคชัน (“บัญชีผู้ใช้”) และแก้ไขบัญชีผู้ใช้ให้ถูกต้องและตรงต่อความเป็นจริงในปัจจุบันอยู่เสมอ กรณีที่บริษัท ตรวจสอบและพบว่าท่านให้ข้อมูลที่เป็นเท็จ บริษัทขอสงวนสิทธิ์ที่จะระงับหรือเพิกถอนบัญชีหรือระงับการใช้บริการของท่านได้ทันที ซึ่งท่านต้องรับผิดชอบทุกการกระทำภายใต้การใช้บัญชีและรักษารหัสผ่านของท่าน หากพบว่ามีบุคคลอื่นใช้บัญชีของท่านโดยไม่ได้รับอนุญาตท่านต้องรายงานให้บริษัททราบทันที ทั้งนี้ บริษัทจะไม่รับผิดชอบการรับผิดชอบต่อบัญชีหรือรหัสผ่านของท่านกับบุคคลอื่น ในกรณีที่บริษัท ได้ใช้ความเชี่ยวชาญและความระมัดระวังตามสมควรแล้ว หากเกิดการใช้บัญชีของท่านโดยไม่ได้รับอนุญาต อันเนื่องมาจากการบุคคลอื่น บริษัทมีสิทธิเพิกถอนหรือระงับการใช้บัญชีของท่าน จากการที่ท่านหรือบุคคลอื่นกระทำการละเมิดเงื่อนไขของบริษัท
                </Typography>
            </Box>

            <Box sx={{ flexGrow: 1, justifyContent: 'center', display: 'flex', flexDirection: 'column', alignItems: 'center', mb: 2 }}>
                <Typography
                    variant="subtitle1"
                    sx={{
                        my: { xs: 3, md: 2 },
                        maxWidth: 1000,
                        width: '100%'
                    }}
                >
                    3. ข้อมูลส่วนตัว
                </Typography>
                <Typography sx={{ maxWidth: 1000, textIndent: '30px', width: '100%', mb: 1 }}>
                    3.1 ข้อมูลส่วนบุคคลที่บริษัทอาจเก็บรวบรวมนั้นจะรวมถึงแต่ไม่จำกัดเพียง :
                </Typography>
                <Box sx={{ paddingLeft: 10, maxWidth: 1000, width: '100%' }}>
                    <List sx={{ listStyleType: 'decimal' }}>
                        <ListItem sx={{ display: 'list-item', lineHeight: '25px' }}>ชื่อ</ListItem>
                        <ListItem sx={{ display: 'list-item', lineHeight: '25px' }}>ที่อยู่อีเมล</ListItem>
                        <ListItem sx={{ display: 'list-item', lineHeight: '25px' }}>วันเดือนปีเกิด</ListItem>
                        <ListItem sx={{ display: 'list-item', lineHeight: '25px' }}>ที่อยู่ตามบัตรประชาชนหรือพาสปอร์ต</ListItem>
                        <ListItem sx={{ display: 'list-item', lineHeight: '25px' }}>รายละเอียดบัญชีธนาคารและข้อมูลการชำระเงิน</ListItem>
                        <ListItem sx={{ display: 'list-item', lineHeight: '25px' }}>หมายเลขติดต่อ</ListItem>
                        <ListItem sx={{ display: 'list-item', lineHeight: '25px' }}>หมายเลขบัตรประชาชนหรือหมายเลขพาสปอร์ต</ListItem>
                        <ListItem sx={{ display: 'list-item', lineHeight: '25px' }}>เพศ</ListItem>
                        <ListItem sx={{ display: 'list-item', lineHeight: '25px' }}>ที่อยู่อินเทอร์เน็ตโปรโตคอล (IP)</ListItem>
                        <ListItem sx={{ display: 'list-item', lineHeight: '25px' }}>ข้อมูลอื่นใดเกี่ยวกับผู้ใช้เมื่อผู้ใช้ลงทะเบียนเข้าใช้บริการหรือไซต์ของเรา และเมื่อผู้ใช้ใช้บริการหรือไซต์ รวมถึง
                            ข้อมูลที่เกี่ยวกับวิธีการใช้บริการหรือไซต์ของผู้ใช้ ประชาชนทั่วไปและกลุ่มที่ท่านเชื่อมต่อหรืออาจเชื่อมต่อกันบนแพลตฟอร์มของ เรา และลักษณะที่ท่านติดต่อสื่อสารกับบุคคลเหล่านั้น</ListItem>
                        <ListItem sx={{ display: 'list-item', lineHeight: '25px' }}>ข้อมูลจากหรือเกี่ยวกับอุปกรณ์ที่ท่านติดตั้งแอปพลิเคชั่นของเรา และ/หรือใช้อุปกรณ์เพื่อเข้าถึงบริการของเราและ/หรือไซต์</ListItem>
                        <ListItem sx={{ display: 'list-item', lineHeight: '25px' }}>รายละเอียดบัญชีของท่านกับเว็บไซต์หรือแอปพลิเคชั่นของบุคคลภายนอกที่ท่านได้เชื่อมต่อบัญชีผู้ใช้ของท่านกับเราผ่านทางเว็บไซต์
                            ข้อมูลส่วนบุคคลที่ท่านอาจให้แก่เราผ่านทางเว็บไซต์</ListItem>
                    </List>
                </Box>
                <Typography sx={{ maxWidth: 1000, textIndent: '30px', width: '100%', mb: 1 }}>
                    3.2 ตามที่ระบุในส่วนที่ 2 เราอาจได้รับข้อมูลเกี่ยวกับท่านและกิจกรรมของท่านที่อยู่บนและไม่อยู่บนแพลตฟอร์ม จากบริษัทในกลุ่มและ/หรือหุ้นส่วนซึ่งเป็นบุคคลภายนอก เช่น ข้อมูลจากบริษัทในกลุ่มและ/หรือหุ้นส่วนที่เราร่วมกันเสนอบริการและ/หรือรายการส่งเสริมการขาย หรือจากผู้โฆษณาเกี่ยวกับประสบการณ์หรือการติดต่อของท่านกับพวกเขา รวมถึงข้อมูลเกี่ยวกับเว็บไซต์และแอปพลิเคชั่นที่ท่านเข้าเยี่ยมชม การที่ท่านใช้บริการของเราบนเว็บไซต์และแอปพลิเคชั่นเหล่านั้น เช่นเดียวกับข้อมูลผู้พัฒนาหรือผู้เผยแพร่บนแอปพลิเคชั่นหรือเว็บไซต์ที่ให้แก่ท่านหรือเรา
                </Typography>
                <Typography sx={{ maxWidth: 1000, textIndent: '30px', width: '100%', mb: 1 }}>
                    3.3 หากท่านไม่ประสงค์ให้เก็บรวบรวม ข้อมูล/ข้อมูลส่วนบุคคลดังที่กล่าวมาข้างต้น ท่านอาจยกเลิกได้ทุกเมื่อ ผ่านทางเว็บไซต์หรือโดยการแจ้งความประสงค์ให้เจ้าหน้าที่คุ้มครองข้อมูลของเราทราบเป็นลายลักษณ์อักษร อย่างไรก็ตาม โปรดจำไว้ว่าการยกเลิกการเก็บรวบรวมข้อมูลส่วนบุคคลหรือถอนความยินยอมในการเก็บรวบรวม ใช้แบ่งปัน หรือดำเนินการข้อมูลส่วนบุคคลของท่านกับเรานั้นอาจส่งผลต่อการใช้บริการของท่าน ตัวอย่างเช่น การยกเลิกการเก็บรวบรวมข้อมูลเกี่ยวกับตำแหน่งที่ตั้งจะเป็นการปิดใช้งานคุณลักษณะตามตำแหน่งที่ตั้ง
                </Typography>
                <Typography sx={{ maxWidth: 1000, textIndent: '30px', width: '100%', mb: 1 }}>
                    3.4 เมื่อท่านใช้บัตรเครดิตเพื่อทำธุรกรรมบนเว็บไซต์ ท่านกำลังให้ข้อมูลของท่านแก่ผู้ให้บริการภายนอก ในการเชื่อมต่อนั้นข้อมูลที่ท่านได้ให้แก่ผู้ให้บริการภายนอกจะอยู่ภายใต้นโยบายความเป็นส่วนตัวที่เกี่ยวข้องของผู้ให้บริการภายบริษัท ไม่อาจเข้าถึงข้อมูลเช่นว่านั้นและไม่ได้เก็บรวบรวมรายละเอียดบัตรเครดิตของท่าน
                </Typography>
            </Box>
            <Box sx={{ flexGrow: 1, justifyContent: 'center', display: 'flex', flexDirection: 'column', alignItems: 'center', mb: 2 }}>
                <Typography
                    variant="subtitle1"
                    sx={{
                        my: { xs: 3, md: 2 },
                        maxWidth: 1000,
                        width: '100%'
                    }}
                >
                    4. บัญชี และการจัดเก็บข้อมูลบนฐานข้อมูล
                </Typography>
                <Typography sx={{ maxWidth: 1000, textIndent: '30px', width: '100%', mb: 1 }}>
                    4.1 เมื่อผู้ใช้ให้ข้อมูลเกี่ยวกับตนเองแก่บริษัท ผู้ใช้จะต้องให้ข้อมูลที่เป็นจริง ถูกต้องและครบถ้วนในขณะที่ใช้บริการฯ และปรับปรุงข้อมูลดังกล่าวให้เป็นปัจจุบันอยู่ตลอดเวลา
                </Typography>
                <Typography sx={{ maxWidth: 1000, textIndent: '30px', width: '100%', mb: 1 }}>
                    4.2 หากผู้ใช้ลงทะเบียนรหัสผ่านในขณะที่ใช้บริการฯ ผู้ใช้จะต้องใช้ความระมัดระวังและมีความรับผิดชอบตามสมควรเพื่อไม่ให้มีการใช้รหัสผ่านในลักษณะที่ไม่ชอบด้วยกฎหมาย บริษัท สามารถถือว่ากิจกรรมต่างๆ ที่ดำเนินการโดยใช้รหัสผ่านดังกล่าว เป็นกิจกรรมที่ผู้เป็นเจ้าของรหัสผ่านได้ดำเนินการด้วยตนเอง
                </Typography>
                <Typography sx={{ maxWidth: 1000, textIndent: '30px', width: '100%', mb: 1 }}>
                    4.3 ผู้ใช้งานที่จดทะเบียนใช้บริการฯ สามารถลบบัญชีของตนและเลิกใช้บริการฯ ได้ ไม่ว่าในเวลาใดๆ ก็ตาม
                </Typography>
                <Typography sx={{ maxWidth: 1000, textIndent: '30px', width: '100%', mb: 1 }}>
                    4.4 บริษัทฯ อาจระงับหรือลบบัญชีของผู้ใช้ได้โดยไม่ต้องให้คำบอกกล่าวล่วงหน้าแก่ผู้ใช้ หากบริษัท เห็นว่าผู้ใช้กำลังละเมิดหรือได้ละเมิดข้อกำหนดและเงื่อนไขฯ
                </Typography>
                <Typography sx={{ maxWidth: 1000, textIndent: '30px', width: '100%', mb: 1 }}>
                    4.5 บริษัทฯ สงวนสิทธิ์ที่จะลบบัญชีใดๆ ที่ไม่มีการเปิดใช้งานเป็นเวลา 1 ปีหรือนานกว่านั้นนับตั้งแต่วันที่มีการเปิดใช้งานบัญชีดังกล่าวครั้งล่าสุด โดยไม่ต้องให้คำบอกกล่าวล่วงหน้าใดๆ แก่ผู้ใช้
                </Typography>
                <Typography sx={{ maxWidth: 1000, textIndent: '30px', width: '100%', mb: 1 }}>
                    4.6 สิทธิที่จะใช้บริการของผู้ใช้จะสิ้นสุดลงเมื่อมีการลบบัญชีของผู้ใช้ไม่ว่าด้วยเหตุผลใดๆ ก็ตาม บัญชีจะไม่สามารถกู้คืนมาได้แม้ว่าผู้ใช้จะลบบัญชีของตนโดยไม่ได้ตั้งใจก็ตาม และบริษัทฯ ขอให้ผู้ใช้ตระหนักถึงเรื่องนี้ด้วย
                </Typography>
                <Typography sx={{ maxWidth: 1000, textIndent: '30px', width: '100%', mb: 1 }}>
                    4.7 บัญชีแต่ละบัญชีในบริการฯ มีไว้เพื่อการใช้งานเฉพาะและเป็นของเจ้าของบัญชีแต่เพียงผู้เดียวเท่านั้นผู้ใช้ไม่สามารถโอนหรือให้ยืมบัญชีของตนแก่บุคคลภายนอกใดๆ และบุคคลภายนอกใดๆ ไม่สามารถรับช่วงบัญชีจากผู้ใช้ได้
                </Typography>
            </Box>
            <Box sx={{ flexGrow: 1, justifyContent: 'center', display: 'flex', flexDirection: 'column', alignItems: 'center', mb: 2 }}>
                <Typography
                    variant="subtitle1"
                    sx={{
                        my: { xs: 3, md: 2 },
                        maxWidth: 1000,
                        width: '100%'
                    }}
                >
                    5. การเปิดเผยข้อมูล
                </Typography>
                <Typography sx={{ maxWidth: 1000, width: '100%', mb: 1 }}>
                    ข้อมูลทั้งหมดที่ให้ไว้โดยท่านหรือที่เก็บรวบรวมโดยบริษัทฯ ในการเชื่อมต่อกับบริการจะเป็นไปตามนโยบายความเป็นส่วนตัวของบริษัทฯ บริษัทฯอาจใช้ข้อมูลที่ได้รับหรือเก็บรวบรวมเกี่ยวกับการใช้งาน ระยะเวลาการใช้งานประเภทของผลงานภายใต้เงื่อนไขนโยบายความเป็นส่วนตัว โดยบริษัทฯใช้ข้อมูลดังกล่าวเพื่อวัตถุประสงค์ทางการตลาดหรือโฆษณาเหตุการณ์หรือบริการอื่นๆ ที่อาจเป็นที่สนใจของท่าน นอกจากนี้ข้อมูลที่ส่งหรือที่ท่านให้แก่บริษัทฯที่ประชาชนทั่วไปอาจสามารถเข้าถึงข้อมูลนั้นได้ ท่านควรรักษาข้อมูลเป็นอย่างดีเพื่อรักษาข้อมูลส่วนตัวหรือข้อมูลที่มีความสำคัญกับท่าน บริษัทฯจะไม่รับผิดชอบรักษาข้อมูลใดๆ ดังกล่าวและจะไม่รับผิดชอบในการรักษาข้อมูลความเป็นส่วนตัวของจดหมายอิเล็กทรอนิกส์หรือข้อมูลอื่นๆ ที่ผ่านทางอินเตอร์เน็ตหรือเครือข่ายอื่นๆ ที่ท่านอาจจะใช้ บริษัทฯขอสงวนสิทธิ์ในการควบคุมและรับผิดชอบต่อการกระทำของท่าน
                </Typography>
            </Box>
            <Box sx={{ flexGrow: 1, justifyContent: 'center', display: 'flex', flexDirection: 'column', alignItems: 'center', mb: 2 }}>
                <Typography
                    variant="subtitle1"
                    sx={{
                        my: { xs: 3, md: 2 },
                        maxWidth: 1000,
                        width: '100%'
                    }}
                >
                    6. การให้ข้อมูลของผู้ใช้
                </Typography>
                <Typography sx={{ maxWidth: 1000, width: '100%', mb: 1 }}>
                    ข้อมูลที่ท่านใส่ลงในเว็บไซต์หรือแอปพลิเคชัน เช่น ความคิดเห็นเกี่ยวกับผลิตภัณฑ์ การสื่อสารกับบริษัทฯที่ท่านเขียนในเว็บไซต์หรือแอปพลิเคชัน ฯลฯ ยกเว้นข้อมูลที่สามารถบ่งบอกถึงตัวผู้ใช้งาน บริษัทฯจะถือว่าเป็นข้อมูลที่มิใช่ความลับของผู้ใช้งาน และบริษัทฯสามารถนำไปใช้ต่อในการโฆษณา หรือพัฒนาบริษัทฯและอื่นๆบริษัทฯไม่อนุญาตให้ท่านเขียนข้อความที่ผิดกฎหมาย ข่มขู่ คุกคาม ทำให้บริษัทฯเสียชื่อเสียงลงในเว็บไซต์หรือแอปพลิเคชัน บริษัทฯจะไม่รับผิดชอบในความคิดเห็นเกี่ยวกับผลิตภัณฑ์ที่ผู้ใช้เขียนลงในเว็บไซต์หรือแอปพลิเคชัน เนื่องจากเป็นสิ่งที่ผู้ใช้เขียน และไม่ได้มีส่วนเกี่ยวข้องกับความคิดเห็นของทางบริษัทฯ
                </Typography>
            </Box>
            <Box sx={{ flexGrow: 1, justifyContent: 'center', display: 'flex', flexDirection: 'column', alignItems: 'center', mb: 2 }}>
                <Typography
                    variant="subtitle1"
                    sx={{
                        my: { xs: 3, md: 2 },
                        maxWidth: 1000,
                        width: '100%'
                    }}
                >
                    7. ข้อสงวนสิทธิ์ในการใช้ข้อมูล
                </Typography>
                <Typography sx={{ maxWidth: 1000, width: '100%', mb: 1 }}>
                    ผู้ใช้จะต้องไม่มีส่วนร่วมในกิจกรรมต่างๆ ดังต่อไปนี้เมื่อใช้บริการฯ
                </Typography>
                <Typography sx={{ maxWidth: 1000, textIndent: '30px', width: '100%', mb: 1 }}>
                    7.1 กิจกรรมที่ฝ่าฝืนกฎหมาย คำพิพากษา มติหรือคำสั่งศาล หรือมาตรการทางปกครองที่มีผลผูกพันทางกฎหมาย
                </Typography>
                <Typography sx={{ maxWidth: 1000, textIndent: '30px', width: '100%', mb: 1 }}>
                    7.2 กิจกรรมที่อาจขัดต่อความสงบเรียบร้อยหรือศีลธรรมอันดีของประชาชน
                </Typography>
                <Typography sx={{ maxWidth: 1000, textIndent: '30px', width: '100%', mb: 1 }}>
                    7.3 กิจกรรมที่ละเมิดสิทธิในทรัพย์สินทางปัญญา เช่น ลิขสิทธิ์ เครื่องหมายการค้าและสิทธิบัตร ชื่อเสียง ความเป็นส่วนตัว และสิทธิอื่นๆ ทั้งหมดของบริษัทฯ และ/หรือบุคคลภายนอกที่มีการมอบให้ตามกฎหมายหรือตามสัญญา
                </Typography>
                <Typography sx={{ maxWidth: 1000, textIndent: '30px', width: '100%', mb: 1 }}>
                    7.4 กิจกรรมที่แสดงหรือส่งต่อซึ่งการแสดงออกที่มีลักษณะรุนแรงหรือเกี่ยวกับเพศ การแสดงออกที่นำไปสู่การเลือกปฏิบัติโดยเชื้อชาติ สัญชาติ ความเชื่อ เพศ สถานะทางสังคม ถิ่นกำเนิดครอบครัว และอื่นๆ การแสดงออกที่ชักชวนหรือส่งเสริมการฆ่าตัวตาย พฤติกรรมการทำร้ายตัวเองหรือการใช้ยาในทางที่ผิด หรือการแสดงออกที่ต่อต้านสังคมซึ่งประกอบด้วยเนื้อหาที่ต่อต้านสังคมและทำให้บุคคลอื่นเกิดความไม่สบายใจ
                </Typography>
                <Typography sx={{ maxWidth: 1000, textIndent: '30px', width: '100%', mb: 1 }}>
                    7.5 กิจกรรมที่อาจทำให้ผู้อื่นเข้าใจผิดเกี่ยวกับบริษัทฯ และ/หรือบุคคลภายนอก หรือการจงใจเผยแพร่ข้อมูลเท็จ
                </Typography>
                <Typography sx={{ maxWidth: 1000, textIndent: '30px', width: '100%', mb: 1 }}>
                    7.6 กิจกรรมที่มีการแลกเปลี่ยนสิทธิในการใช้เนื้อหาฯ เป็นเงินสด ทรัพย์สินหรือผลประโยชน์ทางเศรษฐกิจอื่นๆ โดยไม่ได้รับอนุญาตจากบริษัทฯ
                </Typography>
                <Typography sx={{ maxWidth: 1000, textIndent: '30px', width: '100%', mb: 1 }}>
                    7.7 กิจกรรมที่มีการใช้บริการฯ เพื่อการขาย การตลาด โฆษณา การชักชวน หรือวัตถุประสงค์ทางการค้าอื่นๆ(ยกเว้นวัตถุประสงค์ที่ได้รับความเห็นชอบจากบริษัทฯ) กิจกรรมที่มีการใช้บริการฯ เพื่อการกระทำทางเพศหรือการกระทำที่อนาจาร กิจกรรมที่มีการใช้บริการฯ เพื่อวัตถุประสงค์ในการพบบุคคลเพื่อการมีเพศสัมพันธ์ กิจกรรมที่ใช้บริการฯ เพื่อวัตถุประสงค์ในการคุกคาม หรือการหมิ่นประมาทผู้ใช้รายอื่นๆ หรือกิจกรรมที่ใช้บริการฯ เพื่อวัตถุประสงค์อื่นๆ ที่มิใช่จุดประสงค์ที่แท้จริงของบริการฯ
                </Typography>
                <Typography sx={{ maxWidth: 1000, textIndent: '30px', width: '100%', mb: 1 }}>
                    7.8 กิจกรรมที่เป็นประโยชน์ต่อหรือเป็นการร่วมมือกับกลุ่มที่ต่อต้านสังคม
                </Typography>
                <Typography sx={{ maxWidth: 1000, textIndent: '30px', width: '100%', mb: 1 }}>
                    7.9 กิจกรรมที่เกี่ยวกับกิจกรรมทางศาสนาหรือการเชื้อเชิญให้เข้ากลุ่มทางศาสนา
                </Typography>
                <Typography sx={{ maxWidth: 1000, textIndent: '30px', width: '100%', mb: 1 }}>
                    7.10 กิจกรรมที่นำไปสู่การเก็บรวบรวม การเปิดเผย หรือการให้ข้อมูลส่วนบุคคลของบุคคลอื่น ข้อมูลที่จด ทะเบียน ประวัติผู้ใช้ หรือข้อมูลอื่นๆ ในทำนองเดียวกันโดยไม่ชอบด้วยกฎหมายหรือไม่เหมาะสม
                </Typography>
                <Typography sx={{ maxWidth: 1000, textIndent: '30px', width: '100%', mb: 1 }}>
                    7.11 กิจกรรมที่แทรกแซงเครื่องแม่ข่าย และ/หรือระบบเครือข่ายของบริการฯ กิจกรรมซึ่งเป็นการใช้บริการฯในทางที่ผิดด้วยการใช้บ็อท (BOTs) เครื่องมือเพื่อการโกง หรือวิธีการทางเทคนิคอื่นๆ กิจกรรมที่ใช้ข้อบกพร่องของบริการฯ โดยไตร่ตรองไว้ก่อน กิจกรรมที่ทำการสอบถามอย่างไม่สมควร และ/หรือสิทธิเรียกร้องที่ไม่ควรได้ เช่น การถามคำถามเดียวกันซ้ำๆ เกินความจำเป็น และกิจกรรมที่แทรกแซงการให้บริการฯ ของบริษัทฯ หรือการใช้บริการฯของผู้ใช้
                </Typography>
                <Typography sx={{ maxWidth: 1000, textIndent: '30px', width: '100%', mb: 1 }}>
                    7.12 กิจกรรมที่ให้ความช่วยเหลือหรือส่งเสริมกิจกรรมใดๆ ที่ระบุไว้ในข้อ 1 ถึงข้อ 12 ข้างต้น
                </Typography>
                <Typography sx={{ maxWidth: 1000, textIndent: '30px', width: '100%', mb: 1 }}>
                    7.13 กิจกรรมอื่นๆ ที่บริษัทฯ เห็นว่าไม่เหมาะสม
                </Typography>
            </Box>
            <Box sx={{ flexGrow: 1, justifyContent: 'center', display: 'flex', flexDirection: 'column', alignItems: 'center', mb: 2 }}>
                <Typography
                    variant="subtitle1"
                    sx={{
                        my: { xs: 3, md: 2 },
                        maxWidth: 1000,
                        width: '100%'
                    }}
                >
                    8. การรับรองและการรับประกันของท่าน
                </Typography>
                <Typography sx={{ maxWidth: 1000, width: '100%', mb: 1 }}>
                    ท่านรับรองและรับประกันว่า :
                </Typography>
                <Typography sx={{ maxWidth: 1000, textIndent: '30px', width: '100%', mb: 1 }}>
                    8.1 ท่านบรรลุนิติภาวะ (และในกรณีของผู้เยาว์ ได้รับความยินยอมจากพ่อแม่หรือผู้ปกครองตามกฎหมาย) มีสิทธิและความสามารถที่จะเข้าทำสัญญาเงื่อนไขการให้บริการนี้และปฏิบัติตามเงื่อนไขนี้ และ
                </Typography>
                <Typography sx={{ maxWidth: 1000, textIndent: '30px', width: '100%', mb: 1 }}>
                    8.2 ท่านจะใช้บริการเพื่อจุดประสงค์ที่ถูกกฎหมายและตามเงื่อนไขการให้บริการนี้ และกฎหมาย กฎระเบียบ ประมวลกฎหมาย คำสั่ง แนวทางปฏิบัติ นโยบายและข้อบังคับที่บังคับใช้ทั้งหมด
                </Typography>
            </Box>
            <Box sx={{ flexGrow: 1, justifyContent: 'center', display: 'flex', flexDirection: 'column', alignItems: 'center', mb: 2 }}>
                <Typography
                    variant="subtitle1"
                    sx={{
                        my: { xs: 3, md: 2 },
                        maxWidth: 1000,
                        width: '100%'
                    }}
                >
                    9. ทรัพย์สินทางปัญญาของบริษัทฯ
                </Typography>
                <Typography sx={{ maxWidth: 1000, width: '100%', mb: 1 }}>
                    ผลงานทั้งหมดที่มีในบริการของบริษัทฯ เช่น เนื้อหา ข้อความ กราฟิก โลโก้ ปุ่มไอคอน รูปภาพ และอื่นๆโดยรวม อีกทั้งซอฟต์แวร์ที่ใช้ในเว็บไซต์หรือแอปพลิเคชันล้วนเป็นทรัพย์สินของบริษัทฯ ซึ่งได้รับความคุ้มครองภายใต้กฎหมายไทยและกฎหมายสากลอย่างไม่จำกัดว่าด้วยลิขสิทธิ์และกฎหมายอื่นๆ ที่คุ้มครองทรัพย์สินทางปัญญาและสิทธิของบริษัทฯ ท่านตกลงที่จะไม่ละเมิดลิขสิทธิ์และปฏิบัติตามกฎหมายอื่นๆ ข้อมูลและข้อจำกัดที่มีอยู่ในเนื้อหาใดๆ ที่เข้าถึงได้ผ่านทางเว็บไซต์หรือแอปพลิเคชัน ท่านยินยอมที่จะคอยติดตามและปฏิบัติตามกฎหมายลิขสิทธิ์และกฎหมายอื่นๆ รวมถึงคำบรรยายหรือข้อบังคับอื่นๆ ที่ปรากฏอยู่ในผลงานและจะไม่ทำการเปลี่ยนแปลงผลงานดังกล่าวที่บุคคลอื่นเป็นเจ้าของลิขสิทธิ์อย่างไม่จำกัดในผลงานนั้น หากมิได้รับอนุญาตจากเจ้าของลิขสิทธิ์ท่านเห็นด้วยว่าท่านไม่สามารถครอบครองสิทธิ์ความเป็นเจ้าของในการดาวน์โหลดเนื้อหานั้นๆ ผ่านบริการทางเว็บไซต์หรือแอปพลิเคชัน หากมิได้มีการกำหนดไว้ตามกฎหมายหรือมิได้รับอนุญาตจากเงื่อนไขการให้บริการของทางเว็บไซต์หรือแอปพลิเคชัน รวมถึงท่านไม่สามารถดัดแปลง ใช้วิธีวิศวกรรมย้อนรอยเพื่อทำขึ้นมาใหม่ เผยแพร่ ส่งผ่านจัดแสดง มีส่วนร่วมในการขาย สร้างผลงานลอกเลียนแบบ หรือหาผลประโยชน์ในทางพาณิชย์กับบุคคลที่อื่นจากเว็บไซต์หรือแอปพลิเคชันทั้งหมดหรือบางส่วนโดยมิได้รับอนุญาตอย่างชัดเจนจาก บริษัทฯและเจ้าของผลงานนั้นๆเราไม่อนุญาตท่านให้ใช้ทรัพย์สินทางปัญญาของบริษัทฯหรือขอเจ้าของลิขสิทธิ์ของเรา ยกเว้นกรณีที่ได้รับอนุญาตตามเงื่อนไขแห่งสัญญานี้
                </Typography>
            </Box>
            <Box sx={{ flexGrow: 1, justifyContent: 'center', display: 'flex', flexDirection: 'column', alignItems: 'center', mb: 2 }}>
                <Typography
                    variant="subtitle1"
                    sx={{
                        my: { xs: 3, md: 2 },
                        maxWidth: 1000,
                        width: '100%'
                    }}
                >
                    10. การละเมิดลิขสิทธิ์
                </Typography>
                <Typography sx={{ maxWidth: 1000, width: '100%', mb: 1 }}>
                    ท่านรับรองว่าการร่วมกิจกรรมของท่านภายใต้เว็บไซต์และแอปพลิเคชันของเรามิได้ละเมิดลิขสิทธิ์ สิทธิตามกฎหมาย (รวมทั้งสิทธิความเป็นส่วนบุคคลและการเปิดเผยต่อสาธารณะ) ของบุคคลอื่น หรือระเบียบสังคมหรือกฎหมายต่างๆ ไม่ว่าทั้งหมดหรือบางส่วน หากปรากฏในภายหลังว่าการร่วมกิจกรรมภายใต้เว็บไซต์และแอปพลิเคชันของท่านมีการละเมิดสิทธิดังกล่าว ไม่ว่าทั้งหมดหรือบางส่วน และมีการเรียกร้องค่าเสียหาย ท่านจะดำเนินการทั้งปวง เพื่อให้การกล่าวอ้างหรือการเรียกร้องดังกล่าวระงับสิ้นไปโดยเร็ว ท่านตกลงที่จะรับผิดและชดใช้ค่าเสียหายค่าใช้จ่ายต่างๆ รวมทั้งค่าฤชาธรรมเนียม และค่าทนายความให้แก่บริษัทฯ ทั้งหมด อันเนื่องจากผลแห่งการละเมิดลิขสิทธิ์หรือสิทธิอื่นใดดังกล่าว
                </Typography>
            </Box>
            <Box sx={{ flexGrow: 1, justifyContent: 'center', display: 'flex', flexDirection: 'column', alignItems: 'center', mb: 2 }}>
                <Typography
                    variant="subtitle1"
                    sx={{
                        my: { xs: 3, md: 2 },
                        maxWidth: 1000,
                        width: '100%'
                    }}
                >
                    11. กฎหมายที่ใช้บังคับ
                </Typography>
                <Typography sx={{ maxWidth: 1000, width: '100%', mb: 1 }}>
                    เงื่อนไขการให้บริการนี้จะอยู่ภายใต้บังคับและตีความตามกฎหมายของประเทศไทย โดยไม่คำนึงถึงความขัดแย้งกับกฎแห่งกฎหมาย อนุสัญญาสหประชาชาติว่าด้วยสัญญาการจำหน่ายสินค้าระหว่างประเทศและกฎหมายธุรกรรมข้อมูลคอมพิวเตอร์ที่เป็นมาตรฐานเดียวกัน ถึงขอบเขตที่บังคับใช้ได้ ถูกสงวนสิทธิ์ไว้อย่างชัดแจ้ง เว้นแต่กฎหมายที่บังคับใช้จะกำหนดไว้เป็นอย่างอื่น ข้อพิพาท ข้อขัดแย้ง การเรียกร้องสิทธิหรือความแตกต่างทุกประเภทที่อาจจะเกิดขึ้น จากหรือเกี่ยวข้องกับเงื่อนไขการให้บริการนี้ ต่อหรือเกี่ยวข้องกับบริษัทหรือฝ่ายที่ได้รับการชดใช้ภายใต้เงื่อนไขการให้บริการนี้ ให้ส่งเรื่องและยุติในขั้นตอนสุดท้ายโดยอนุญาโตตุลาการประเทศไทยตามกฎการอนุญาโตตุลาการของสถาบันอนุญาโตตุลาการ (“กฎ THAC”) ที่บังคับใช้อยู่ในขณะนี้ ซึ่งถือว่าได้รวมกฎเข้าไว้โดยการอ้างอิงในส่วนนี้ จะมีอนุญาโตตุลาการหนึ่ง 1 ท่านและภาษาในการอนุญาโตตุลาการคือภาษาไทย
                </Typography>

            </Box>
            <Box sx={{ flexGrow: 1, justifyContent: 'center', display: 'flex', flexDirection: 'column', alignItems: 'center', mb: 2 }}>
                <Typography sx={{ maxWidth: 1000, width: '100%', mb: 2 }}>
                    หากท่านมีข้อสงสัยเกี่ยวกับข้อตกลงก่อนการเป็นสมาชิกนี้ โปรดติดต่อบริษัทฯทาง
                </Typography>
                <Typography sx={{ maxWidth: 1000, width: '100%', mb: 2 }}>
                    <Link target="_blank" href="mailto:info@checkrace.com">info@checkrace.com</Link>
                </Typography>
                <Typography sx={{ maxWidth: 1000, width: '100%', mb: 1 }}>
                    +66 (0)61 010 4669
                </Typography>
            </Box> */}
        </Container>
    )
}